#language: ru

  Функционал: OZON.ru
    Сценарий: Добавление и удаление товаров
      Когда Закрыто сообщение о cookies
      Когда Введено в поиске iphone
      Когда Ограничена цена до 100000
      Когда Отмечен высокий рейтинг
      Когда Выбран объем оперативной памяти 3
      Когда Добавлены в корзину 7 нечетных товаров
      Когда Сохранены названия 7 добавленных товаров
      Когда Перешли в корзину
      Когда Проверили, что корзина содержит 7 товаров
      Когда Удалили все товары из корзины
      Когда Проверили, что корзина пуста
